
# 24th November 2019

In [5]:
import pandas as pd
import numpy as np

In [6]:
df1 = pd.read_csv("C:/Users/hp/Desktop/27Nov_Book1.csv")
df1

     Name   Age  Course
0  Salman   20.0     AI
1  Rehaan  100.0     AI
2  Faizan   22.0     CC
3   Uzaif    NaN    NaN
4  Rehaan   21.0     BC
5   Talha   20.0    NaN
6  Raheel  400.0     BC
7  Rehaan   21.0     BC

In [7]:
df1.isnull()

    Name   Age   Course
0  False  False   False
1  False  False   False
2  False  False   False
3  False   True    True
4  False  False   False
5  False  False    True
6  False  False   False
7  False  False   False

In [8]:
df1.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [10]:
df1.drop_duplicates()

     Name   Age  Course
0  Salman   20.0     AI
1  Rehaan  100.0     AI
2  Faizan   22.0     CC
3   Uzaif    NaN    NaN
4  Rehaan   21.0     BC
5   Talha   20.0    NaN
6  Raheel  400.0     BC

In [11]:
df1.drop_duplicates(keep="last")

     Name   Age  Course
0  Salman   20.0     AI
1  Rehaan  100.0     AI
2  Faizan   22.0     CC
3   Uzaif    NaN    NaN
5   Talha   20.0    NaN
6  Raheel  400.0     BC
7  Rehaan   21.0     BC

In [12]:
df1.drop_duplicates()

     Name   Age  Course
0  Salman   20.0     AI
1  Rehaan  100.0     AI
2  Faizan   22.0     CC
3   Uzaif    NaN    NaN
4  Rehaan   21.0     BC
5   Talha   20.0    NaN
6  Raheel  400.0     BC

# Discretization And Binning

In [31]:
a = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [23]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [24]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [25]:
pd.value_counts(cats) #Counts values of categories

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [30]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [29]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names) #labeling the ranges as group_names

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [33]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.022469     0.040637    -0.002559    -0.001826
std       0.970825     0.997483     1.012820     0.940619
min      -3.697973    -3.538716    -3.630666    -2.996254
25%      -0.691616    -0.633003    -0.706332    -0.659631
50%      -0.058829     0.005038     0.005687     0.000742
75%       0.600855     0.732743     0.704656     0.624520
max       4.052750     2.720775     2.945762     2.784502

In [34]:
col = data[2]
col[np.abs(col) > 3]

85    -3.630666
528   -3.553792
Name: 2, dtype: float64

# Computing Dummy Variables

In [36]:
df1.sample(n=3)

     Name  Age  Course
0  Salman  20.0     AI
5   Talha  20.0    NaN
7  Rehaan  21.0     BC

In [38]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [43]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [41]:
course = pd.get_dummies(df1['Course']) #Unique values and makes Dataframe of 1's and 0's as Trues and False, Describing what value is existing in a particular row 
course

   AI  BC  CC
0   1   0   0
1   1   0   0
2   0   0   1
3   0   0   0
4   0   1   0
5   0   0   0
6   0   1   0
7   0   1   0

In [42]:
df1

     Name   Age  Course
0  Salman   20.0     AI
1  Rehaan  100.0     AI
2  Faizan   22.0     CC
3   Uzaif    NaN    NaN
4  Rehaan   21.0     BC
5   Talha   20.0    NaN
6  Raheel  400.0     BC
7  Rehaan   21.0     BC

In [44]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [45]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [46]:
'::'.join(pieces)

'a::b::guido'